[{"author_name": "Colleen Ann M.", "text": "I needed to send sympathy flowers to a friend and hoped that I could have them delivered same day, but it was already 1:30. As most other florists, Ace states that same day delivery orders must be placed by 12pm. I figured it wasn&#39;t the end of the world that they&#39;d be delivered the next day, but I was happily surprised that the flowers were delivered in just AN HOUR!! And from the photo my friend sent, they looked gorgeous and just as pictured on the website. For a small business, I was impressed that Ace even offered online ordering, as other more &#34;upscale&#34; nurseries in the area don&#39;t. All in all, I&#39;d recommend Ace to anyone in the area!!!", "author_url": "https://www.yelp.com/user_details?userid=mqBqdOiXFTzXEuqT91fR3Q", "created_at": "1/17/2022", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png", "raiting": 5}, {"author_name": "Genna A.", "text": "What exquisite roses ! Flowers were delivered to my job , everyone couldn&#39;t believe how gorgeous the bouquet was . <br>Wish i could have given 10 stars !", "author_url": "https://www.yelp.com/user_details?userid=kqNf53Y2cFEvX1ES6lAcRw", "created_at": "11/29/2019", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/IxJXb5NcGx29cAlQDGmVzA/60s.jpg", "raiting": 5}, {"author_name": "Fran L.", "text": "Ace florist is first rate. Every arrangement whether all flowers or specially created baskets is made to perfection. Dean handles my orders and they are delivered on time and each person remarks that the baskets are beautiful and the floral arrangements spectacular. Whether you go in personally or call for an order it is expedited and delivered on time. I sent a memorial basket this week and everyone stated it was the highlight of their day and made everyone smile. So thank you ace florist the number one florist and only florist this radio host author and reviewer will ever use. Fran lewis", "author_url": "https://www.yelp.com/user_details?userid=KRewCImW_b9zIh-UyvL7RQ", "created_at": "1/12/2018", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/iTO9c2-eQjK9mBAvDPad5Q/60s.jpg", "raiting": 5}, {"author_name": "Alexandra F.", "text": "I ordered flowers over the phone to be delivered since I don&#39;t live in New York. It was a gift for a friend who lost a loved one. Ace asked me what price range I wanted and that to trust them to make something nice. I had no idea what to expect but the arrangement they made was beautiful and more than I expected. It took 5 minutes to order, Shipping was only $9.95 and they arrived the Next day with no issues at all.", "author_url": "https://www.yelp.com/user_details?userid=5z2pHy-QF6VodSf4AERt8A", "created_at": "6/30/2015", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/-7-PyszKKo7rBB47QbMlpw/60s.jpg", "raiting": 5}, {"author_name": "Chris M.", "text": "Absolutely terrible! I ordered through FTD and delivered to 2 different locations. FTD contacted to separate florists for the same type of bouquet and they were 2 completely different qualities. The first looked beautiful and I was so excited to see how it arrived and couldn&#39;t wait to see the second. Then the second came from Ace Florist and it was horrendous looking and sickly looking. Absolutely ashamed at this florist and will never order again.", "author_url": "https://www.yelp.com/user_details?userid=i4OfrOimFOBeaHJ3Y1HQTw", "created_at": "5/8/2016", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/gZ1TO_agxtz3C5xo-Sh9lA/60s.jpg", "raiting": 1}, {"author_name": "Mary L.", "text": "My father passed away in April and ace was great. Professional and kind. The arrangements were beautiful, especially for the price and lasted long after we took one home. Definitely recommend.", "author_url": "https://www.yelp.com/user_details?userid=T5-85pMzymrv8wyTY_QsyQ", "created_at": "7/27/2017", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/Hg3vRX_bc-Pq1ZL0DDUx0Q/60s.jpg", "raiting": 5}, {"author_name": "Andrew Y.", "text": "The store was empty when I got there so the owner helped me extensively to choose the perfect flowers for a special occasion.  They were opened until pretty late on a Saturday (closes at 6pm), so it gave me time to run errands in the afternoon and still arrive here with 1 hour left before closing.<br><br>The choices of flowers weren&#39;t over the top; they have your classic roses and lilies.  I was looking for a specific flower (peony) but of course it was out of season.  The owner helped me to choose the next best pink-ish flower, carnations.  He added some touches to the wrapping to make it look fantastic.<br><br>Overall I am a big fan of this place, though you should call in advance to see if they have specific flowers that you&#39;d want.", "author_url": "https://www.yelp.com/user_details?userid=Vrz3nk4Hw6lLOsFdQfLJPg", "created_at": "10/24/2016", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png", "raiting": 4}, {"author_name": "Boomer F.", "text": "So the weirdest thing just happened. I have never seen it before in my life. Aces made an error yesterday and delivered us the wrong flowers. Today they rang the doorbell and asked for the flowers back.The delivery driver then handed us a basket. My question is: did the basket we just receive come from another house and what are you doing with the flowers that you made us give back? I don&#39;t want to have something that wasn&#39;t ours but that was awkward.", "author_url": "https://www.yelp.com/user_details?userid=zyMZsjF0fIWzakfck5cMmA", "created_at": "1/21/2017", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/CMOrKUcgQmoTssx4kXEPwQ/60s.jpg", "raiting": 2}, {"author_name": "John F.", "text": "So, I got myself in some real hot water with my big, dumb mouth! I said some things I regret. I definitely apologized but needed a little extra on top. Flowers were the way to go! But from where? We have all been burned by the on line, direct grower scams. I needed to go local. She works in Syosset so I took a chance on Ace. The gamble paid off big!  I entered my order on their website at 8:30 am (they open at 9) and by 11 am the beautiful bouquet in a pretty vase was on her desk and I was in my way to redemption! Thank you Ace, I&#39;ll be back on happier occasions!!", "author_url": "https://www.yelp.com/user_details?userid=VGolXveV4jkMYcxVrkl6Hw", "created_at": "3/10/2017", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png", "raiting": 4}, {"author_name": "Katje S.", "text": "Well, I cut it too close again. I didn&#39;t have a gift ready for my wonderful sister&#39;s birthday... I didn&#39;t even get a card in the mail. I looked for a florist close to her, and found these guys. Not only were they able to get a fresh and cheerful bouquet to her in just a few hours, but they did it for a reasonable cost and with professional and friendly service. I called them up, talked with Dean, and he reassured me that he&#39;d have it all taken care of. Thanks, Ace, for making me look good and helping my sister enjoy her special day!", "author_url": "https://www.yelp.com/user_details?userid=CQIK2Z3SjIZcCvCeY-GcHA", "created_at": "2/7/2014", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/fh-SELlO6-hzhHVhPPP_1Q/60s.jpg", "raiting": 5}, {"author_name": "N M.", "text": "A wonderful experience! Ordered same day delivery flowers for a somber occasion for my Mother. They were courteous, delivered on time and the exact bouquet I ordered on line (has not been my experience with other florist). They contacted me to let me know there was no one home to receive the delivery and I appreciated the communication. Since no one would be available until their delivery person left, the owner himself delivered the flowers on his way home! If the flowers didn&#39;t arrive on that date, the meaning would&#39;ve been lost. I was very grateful for how the owner went above and beyond and for the gracious customer service.", "author_url": "https://www.yelp.com/user_details?userid=klOOhXXOE9iAv3ErzaCmAQ", "created_at": "11/16/2016", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/BYQuldPfVw689Yx1nuoWJA/60s.jpg", "raiting": 5}, {"author_name": "Daniel S.", "text": "I went to 1800 Florist and did not feel the love. Then I went here and felt the local feel. They asked me what it was for and what I wanted to spend. He grabbed some flowers went in the back and 2 minutes later came out with a beautiful bouquet. It was for my mother&#39;s birthday and the holidays and it said both of theses things. You could feel the love.", "author_url": "https://www.yelp.com/user_details?userid=fx0jik6n_fNgcSXxM3RJWQ", "created_at": "11/20/2012", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/photo/hUqGDKplGrPZacIJfxBI6g/60s.jpg", "raiting": 5}, {"author_name": "Jimmy K.", "text": "I ordered flowers for my wife&#39;s birthday and was more than pleased with the outcome. I&#39;ve grown accustomed to being disappointed with the final product when compared to the picture on the website but what was delivered looked even better than the picture shown. Thank you! I&#39;ve just moved to the neighborhood so Ace will have my continued business.", "author_url": "https://www.yelp.com/user_details?userid=NDLYQKS5caEnGUrWnW-MSw", "created_at": "9/11/2017", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png", "raiting": 5}, {"author_name": "M E.", "text": "This place needs to learn a few things.  First, deliver what a family has paid good money for to the funeral home, instead of shorting an arrangement with unapproved substitutions and omissions.  Second, when the family returns a centipede-infested corn plant to you and you assure them that you will replace it after speaking to your greenhouse suppliers, do not ignore them for 2 weeks (and counting).  Pat, your rudeness and poor attitude is offensive and you are obnoxious and grumpy.  You are completely wrong for an industry where you should be more professional and especially compassionate when there is a death in one&#39;s family and they bring you a lot of associated business.  Shameful.  People, you need to go elsewhere.  Seriously.", "author_url": "https://www.yelp.com/user_details?userid=kUA1H7T_1EehKeCki1O9vA", "created_at": "3/19/2015", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png", "raiting": 1}, {"author_name": "Mark P.", "text": "My girlfriend lives in Syosset and I always use Ace. They are incredibly reliable and I have never been disappointed with any of their arrangements.  I usually give them a price range and they put together fresh beautiful bouquets.  I was shocked to see any negative reviews because Ace has never failed to impress my girlfriend and I will use no one else in the area.", "author_url": "https://www.yelp.com/user_details?userid=gsdcS61si_BTtL9diYXjwA", "created_at": "5/11/2016", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png", "raiting": 5}, {"author_name": "Mark O.", "text": "horrible owner. very rude when i asked for her because she was &#34;busy&#34; Too busy for coming me coming to the shop i guess! truly a bitch", "author_url": "https://www.yelp.com/user_details?userid=l3wg-Rfx7YUw6DcuSHbnpQ", "created_at": "2/9/2018", "author_photo_url": "https://s3-media0.fl.yelpcdn.com/assets/srv0/yelp_styleguide/514f6997a318/assets/img/default_avatars/user_60_square.png", "raiting": 1}]